&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ПустаяСтрока(Схема) Тогда
		Маппер = Обработки.Демо_КОД_Обработчик_JSONВЗаказ.Создать();
		Схема = Маппер.ПолучитьМакет("СхемаВалидации").ПолучитьТекст();
	КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ЗагрузитьНаСервере()

	Сценарий = Новый Структура;
	Сценарий.Вставить("СхемаМета", Метаданные.Обработки.Демо_КОД_Обработчик_JSONВЗаказ.Макеты.СхемаВалидации);

	ДочерниеСхемыМета = Новый Массив;
	ДочерниеСхемыМета.Добавить(Метаданные.Обработки.Демо_КОД_Обработчик_JSONВСкладыХранения.Макеты.СхемаВалидации);
	ДочерниеСхемыМета.Добавить(Метаданные.Обработки.Демо_КОД_Обработчик_JSONВТовары.Макеты.СхемаВалидации);
	Сценарий.Вставить("ДочерниеСхемыМета", ДочерниеСхемыМета);

	Сценарий = Новый ФиксированнаяСтруктура(Сценарий);
	Сообщение = Новый Структура;
	Сообщение.Вставить("ТелоСообщения", ПолученноеСообщение);
	Конвейер = Обработки.КОД_КонвейерОбработчиковЗагрузкаБазовый.Создать();
	Контекст = Конвейер.НовыйКонтекстВыполнения(Сценарий, Сообщение, "Отладка");
	Обработчик = РеквизитФормыВЗначение("Объект");
	Обработчик.Обработать(Контекст);

КонецПроцедуры
&НаКлиенте
Процедура Загрузить(Команда)

	ЗагрузитьНаСервере();

КонецПроцедуры
