#Область ОписаниеПеременных

Перем СледующийОбработчик;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке для регистрации в подсистеме
// дополнительных отчетов и обработок.
//
// Возвращаемое значение:
//  Структура - параметры регистрации внешней обработки.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	//ПараметрыРегистрации =
	//	ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(
	//		СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	//
	//ПараметрыРегистрации.Вид =
	//	ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	//ПараметрыРегистрации.Версия = "1.0";
	//
	//Возврат ПараметрыРегистрации;
	
КонецФункции

Функция Следующий(Обработчик = Неопределено) Экспорт
	
	Если Обработчик <> Неопределено Тогда
		СледующийОбработчик = Обработчик;
	КонецЕсли;
	
	Возврат СледующийОбработчик;
	
КонецФункции

Процедура Обработать(Контекст, Вход = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	
	КодыУзлов = Неопределено;
	Контекст.Выполнение.Сценарий.Свойство("КодыУзлов", КодыУзлов);
	
	ОграничиватьУзлы = КодыУзлов <> Неопределено И КодыУзлов.Количество();
	
	Если Не ОграничиватьУзлы Тогда
		КодыУзлов = Новый Массив;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КодыУзлов", КодыУзлов);
	Запрос.УстановитьПараметр("ОграничиватьУзлы", ОграничиватьУзлы);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Узлы.Ссылка КАК Узел,
		|	Ссылки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СсылкиПоУзлам
		|ИЗ
		|	ПланОбмена.Демо_КОД_ОбменСайтом КАК Узлы,
		|	ВТ_СсылкиПослеФильтра КАК Ссылки
		|ГДЕ
		|	(НЕ &ОграничиватьУзлы
		|		ИЛИ Узлы.Код В (&КодыУзлов))
		|	И НЕ Узлы.ЭтотУзел
		|	И НЕ Узлы.ПометкаУдаления";
	
	Запрос.Выполнить();
	
	ПередатьДругому(Контекст, Вход);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПередатьДругому(Контекст, Выход = Неопределено)
	
	Если СледующийОбработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СледующийОбработчик.Обработать(Контекст, Выход);
	
КонецПроцедуры

#КонецОбласти