&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонвейерПолноеИмя =
		Метаданные.Обработки.КОД_КонвейерОбработчиковБазовый.ПолноеИмя();
	
	ПланОбменаПолноеИмя =
		Метаданные.ПланыОбмена.Демо_КОД_ОбменСайтом.ПолноеИмя();
	
КонецПроцедуры


&НаСервере
Процедура ФормаПолучитьJSONНаСервере()
	
	ПланОбменаМета =
		Метаданные.НайтиПоПолномуИмени(
			ПланОбменаПолноеИмя);
	
	КонвейерМета =
		Метаданные.НайтиПоПолномуИмени(
			КонвейерПолноеИмя);
	
	ОбъектМетаданных =
		Метаданные.Документы.Демо_Заказ;
	
	Сценарий = НайтиСценарий(
		ПланОбменаМета,
		ОбъектМетаданных,
		КонвейерМета);
	
	Если Сценарий = Неопределено Тогда
		ВызватьИсключение "Сценарий выполнения не найден.";
	КонецЕсли;
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);
	
	КонвейерОбъект =
		КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбработчикОбъект(
			КонвейерМета);
	
	Контекст = КонвейерОбъект.НовыйКонтекстВыполнения(
		Сценарий,
		МассивСсылок,
		ОбъектМетаданных,
		ПланОбменаМета,
		Новый МенеджерВременныхТаблиц,
		"Отладка");
	
	ОбъектОбработчика =
		РеквизитФормыВЗначение("Объект");
		
	ПодготовитьСсылкиПоУзлам(Контекст, Ссылка);	
	ОбъектОбработчика.Обработать(Контекст);
	
	Результат.Очистить();
	
	Для Каждого Выход Из Контекст.Данные.ВыходыОтладки Цикл
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Ссылка = Выход.Ссылка;
		НоваяСтрока.Тело = Выход.Тело;
		НоваяСтрока.Заголовки = ЗаписатьJSON_(Выход.Заголовки);
		НоваяСтрока.Получатели = ПолучателиВСтроку(Выход.Получатели);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ФормаПолучитьТаблицуИJSON(Команда)
	
	ФормаПолучитьJSONНаСервере();
	
КонецПроцедуры

&НаСервере
Функция НайтиСценарий(
	ПланОбменаМета,
	ОбъектМетаданных,
	КонвейерМета)
	
	СоответствиеРеестров =
		КОД_ДиспетчерРегистрацииКОбмену.РеестрКонвейеровПоПланамОбмена();
	
	ОбработкаРеестрМета =
		СоответствиеРеестров[ПланОбменаМета];
	
	Если ОбработкаРеестрМета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Реестр =
		КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбработчикОбъект(
			ОбработкаРеестрМета).РеестрКонвейеровРегистрации();
	
	МассивСценариев = Реестр[ОбъектМетаданных];
	
	Если МассивСценариев = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого Сценарий Из МассивСценариев Цикл
		
		Если Сценарий.Конвейер = КонвейерМета Тогда
			Возврат Сценарий;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучателиВСтроку(Получатели)
	
	ПолучателиСтроки = Новый Массив;
	
	Для Каждого Получатель Из Получатели Цикл
		ПолучателиСтроки.Добавить(Строка(Получатель));
	КонецЦикла;
	
	Возврат СтрСоединить(ПолучателиСтроки, ", ");
	
КонецФункции

&НаСервере
Процедура ПодготовитьСсылкиПоУзлам(Контекст, Ссылка)
	
	ТипыСсылки = Новый Массив;
	ТипыСсылки.Добавить(ТипЗнч(Ссылка));
	
	ТипыУзла = Новый Массив;
	ТипыУзла.Добавить(ТипЗнч(Узел));
	
	ТаблицаСсылок = Новый ТаблицаЗначений;
	
	ТаблицаСсылок.Колонки.Добавить(
		"Ссылка",
		Новый ОписаниеТипов(ТипыСсылки));
	
	ТаблицаСсылок.Колонки.Добавить(
		"Узел",
		Новый ОписаниеТипов(ТипыУзла));
	
	НоваяСтрока = ТаблицаСсылок.Добавить();
	НоваяСтрока.Ссылка = Ссылка;
	НоваяСтрока.Узел = Узел;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц =
		Контекст.Выполнение.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр(
		"ТаблицаСсылок",
		ТаблицаСсылок);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылки.Ссылка КАК Ссылка,
		|	Ссылки.Узел КАК Узел
		|ПОМЕСТИТЬ ВТ_СсылкиПоУзлам
		|ИЗ
		|	&ТаблицаСсылок КАК Ссылки";
	
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьJSON_(Значение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(
		Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции