#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбщееКоличество = Товары.Итог("Количество");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Демо_Заказы.Записывать = Истина;
	Движения.Демо_Заказы.Очистить();

	Для Каждого СтрокаТовара Из Товары Цикл
		Движение = Движения.Демо_Заказы.Добавить();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = СтрокаТовара.Товар;
		Движение.Количество = СтрокаТовара.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
