&НаСервере
Процедура ВыполнитьМаршрутизациюНаСервере()
	
	ПланОбменаМета =
		Метаданные.НайтиПоПолномуИмени(
			ПланОбменаПолноеИмя);
	
	КонвейерМета =
		Метаданные.НайтиПоПолномуИмени(
			КонвейерПолноеИмя);
	
	ОбъектМетаданных =
		Метаданные.Документы.Демо_Заказ;
	
	Сценарий = НайтиСценарий(
		ПланОбменаМета,
		ОбъектМетаданных,
		КонвейерМета);
	
	Если Сценарий = Неопределено Тогда
		ВызватьИсключение "Сценарий выполнения не найден.";
	КонецЕсли;
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);
	
	КонвейерОбъект =
		КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбъектОбработки(
			КонвейерМета);
	
	Контекст = КонвейерОбъект.НовыйКонтекстВыполнения(
		Сценарий,
		МассивСсылок,
		ОбъектМетаданных,
		ПланОбменаМета,
		Новый МенеджерВременныхТаблиц,
		"Отладка");
	
	ПодготовитьСсылкиПослеФильтра(
		Контекст,
		МассивСсылок);
	
	ОбъектОбработчика =
		РеквизитФормыВЗначение("Объект");
	
	ОбъектОбработчика.Обработать(
		Контекст);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц =
		Контекст.Выполнение.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	ВТ_СсылкиПоУзлам";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМаршрутизацию(Команда)
	
	ВыполнитьМаршрутизациюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПланОбменаПолноеИмя =
		Метаданные.ПланыОбмена.Демо_КОД_ОбменСайтом.ПолноеИмя();
	
	КонвейерПолноеИмя =
		Метаданные.Обработки.КОД_КонвейерОбработчиковБазовый.ПолноеИмя();
	
КонецПроцедуры

&НаСервере
Функция НайтиСценарий(
	ПланОбменаМета,
	ОбъектМетаданных,
	КонвейерМета)
	
	СоответствиеРеестров =
		КОД_ДиспетчерРегистрацииКОбмену.РеестрыСценариевПоПланамОбмена();
	
	ОбработкаРеестрМета =
		СоответствиеРеестров[ПланОбменаМета];
	
	Если ОбработкаРеестрМета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Реестр =
		КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбъектОбработки(
			ОбработкаРеестрМета).РеестрКонвейеровРегистрации();
	
	МассивСценариев =
		Реестр[ОбъектМетаданных];
	
	Если МассивСценариев = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого Сценарий Из МассивСценариев Цикл
		
		Если Сценарий.Конвейер = КонвейерМета Тогда
			Возврат Сценарий;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ПодготовитьСсылкиПослеФильтра(
	Контекст,
	МассивСсылок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц =
		Контекст.Выполнение.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр(
		"МассивСсылок",
		МассивСсылок);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СсылкиПослеФильтра
		|ИЗ
		|	Документ.Демо_Заказ КАК Заказы
		|ГДЕ
		|	Заказы.Ссылка В (&МассивСсылок)";
	
	Запрос.Выполнить();
	
КонецПроцедуры