&НаСервере
Процедура ВыполнитьМаршрутизациюНаСервере()
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВызватьИсключение "Не выбрана ссылка.";
	КонецЕсли;
	КодыУзлов = Новый Массив;
	КодыУзлов.Добавить("WEB");
	СценарийСтруктура = Новый Структура;
	СценарийСтруктура.Вставить("КодыУзлов", КодыУзлов);
	Сценарий = Новый ФиксированнаяСтруктура(СценарийСтруктура);
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Конвейер = КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбъектОбработки(Метаданные.Обработки.КОД_КонвейерОбработчиковБазовый);
	Контекст = Конвейер.НовыйКонтекстВыполнения(Сценарий, МассивСсылок, Метаданные.Справочники.Демо_КОД_Товары, Метаданные.ПланыОбмена.Демо_КОД_ОбменСайтом, МенеджерВременныхТаблиц, "Отладка");

	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("Ссылка", Новый ОписаниеТипов(ТипЗнч(Ссылка)));
	СтрокаСсылки = ТаблицаСсылок.Добавить();
	СтрокаСсылки.Ссылка = Ссылка;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаСсылок", ТаблицаСсылок);
	Запрос.Текст = "ВЫБРАТЬ Ссылки.Ссылка КАК Ссылка ПОМЕСТИТЬ ВТ_СсылкиПослеФильтра ИЗ &ТаблицаСсылок КАК Ссылки";
	Запрос.Выполнить();
	Обработчик = РеквизитФормыВЗначение("Объект");
	Обработчик.Обработать(Контекст);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_СсылкиПоУзлам";
	Результат = Запрос.Выполнить().Выгрузить();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМаршрутизацию(Команда)
	ВыполнитьМаршрутизациюНаСервере();
КонецПроцедуры
