#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьФильтрацию(Команда)
	ВыполнитьФильтрациюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьФильтрациюНаСервере()

	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВызватьИсключение "Не выбрана ссылка.";
	КонецЕсли;

	КодыУзлов = Новый Массив;
	КодыУзлов.Добавить("WEB");
	СценарийСтруктура = Новый Структура;
	СценарийСтруктура.Вставить("КодыУзлов", КодыУзлов);
	Сценарий = Новый ФиксированнаяСтруктура(СценарийСтруктура);

	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);

	ОбъектМетаданных = Метаданные.Справочники.Демо_КОД_Товары;
	МетаданныеПланаОбмена = Метаданные.ПланыОбмена.Демо_КОД_ОбменСайтом;
	МетаданныеКонвейера = Метаданные.Обработки.КОД_КонвейерОбработчиковБазовый;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Конвейер = КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбъектОбработки(МетаданныеКонвейера);
	Контекст = Конвейер.НовыйКонтекстВыполнения(Сценарий, МассивСсылок, ОбъектМетаданных,
		МетаданныеПланаОбмена, МенеджерВременныхТаблиц, "Отладка");

	Обработчик = РеквизитФормыВЗначение("Объект");
	Обработчик.Обработать(Контекст);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СсылкиПослеФильтра.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_СсылкиПослеФильтра КАК СсылкиПослеФильтра";
	Результат.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти
