&НаСервере
Процедура ВыполнитьФильтрациюНаСервере()
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВызватьИсключение "Не выбрана ссылка.";
	КонецЕсли;
	КодыУзлов = Новый Массив;
	КодыУзлов.Добавить("WEB");
	СценарийСтруктура = Новый Структура;
	СценарийСтруктура.Вставить("КодыУзлов", КодыУзлов);
	Сценарий = Новый ФиксированнаяСтруктура(СценарийСтруктура);
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Конвейер = Обработки.КОД_КонвейерОбработчиковБазовый.Создать();
	Контекст = Конвейер.НовыйКонтекстВыполнения(Сценарий, МассивСсылок, Метаданные.Справочники.Товары, Метаданные.ПланыОбмена.Демо_КОД_ОбменСайтом, МенеджерВременныхТаблиц, "Отладка");
	Обработчик = РеквизитФормыВЗначение("Объект");
	Обработчик.Обработать(Контекст);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_СсылкиПослеФильтра";
	Результат = Запрос.Выполнить().Выгрузить();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФильтрацию(Команда)
	ВыполнитьФильтрациюНаСервере();
КонецПроцедуры
