#Область ОписаниеПеременных

Перем СледующийОбработчик;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке для регистрации в подсистеме
// дополнительных отчетов и обработок.
//
// Возвращаемое значение:
//  Структура - параметры регистрации внешней обработки.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	//ПараметрыРегистрации =
	//	ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(
	//		СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	//
	//ПараметрыРегистрации.Вид =
	//	ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	//ПараметрыРегистрации.Версия = "1.0";
	//
	//Возврат ПараметрыРегистрации;
	
КонецФункции

Функция Следующий(Обработчик = Неопределено) Экспорт
	
	Если Обработчик <> Неопределено Тогда
		СледующийОбработчик = Обработчик;
	КонецЕсли;
	
	Возврат СледующийОбработчик;
	
КонецФункции

Процедура Обработать(Контекст, Вход = Неопределено) Экспорт
	
	ОбеспечитьПредыдущуюВерсию(Контекст);
	
	Фильтрация(Контекст);
	
	ПередатьДругому(Контекст, Вход);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Фильтрация(Контекст)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", Контекст.Вход.МассивСсылок);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Версии.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СсылкиПослеФильтра
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТекущаяВерсия.Ссылка КАК Ссылка,
		|		ТекущаяВерсия.ПометкаУдаления КАК ПометкаУдаления
		|	ИЗ
		|		Справочник.Демо_КОД_Товары КАК ТекущаяВерсия
		|	ГДЕ
		|		ТекущаяВерсия.Ссылка В (&МассивСсылок)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ПредыдущаяВерсия.Ссылка,
		|		ПредыдущаяВерсия.ПометкаУдаления
		|	ИЗ
		|		ВТ_ПредыдущаяВерсия КАК ПредыдущаяВерсия) КАК Версии
		|ГДЕ
		|	НЕ Версии.ПометкаУдаления";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ОбеспечитьПредыдущуюВерсию(Контекст)
	
	МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	
	Если КОД_ДиспетчерРегистрацииКОбмену.ВременнаяТаблицаСуществует(
		МенеджерВременныхТаблиц,
		"ВТ_ПредыдущаяВерсия") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ОбъектМетаданных = Метаданные.Справочники.Демо_КОД_Товары;
	ПоляОбъекта = КОД_ДиспетчерРегистрацииКОбмену.ПоляОбъектаДляЗапроса(ОбъектМетаданных, "Источник");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ПоляОбъекта
		|ПОМЕСТИТЬ ВТ_ПредыдущаяВерсия
		|ИЗ
		|	&Источник КАК Источник
		|ГДЕ
		|	ЛОЖЬ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Источник", ОбъектМетаданных.ПолноеИмя());
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляОбъекта", ПоляОбъекта);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПередатьДругому(Контекст, Выход = Неопределено)
	
	Если СледующийОбработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СледующийОбработчик.Обработать(Контекст, Выход);
	
КонецПроцедуры

#КонецОбласти
